{"114514":"<p>这篇文章是一篇日记，记录了作者和家人在2022年12月23日至2023年1月4日之间感染新冠病毒的经历。作者描述了他们的症状，如发烧、咳嗽、喉咙痛、腰酸背痛等，并记录了他们吃药、请假、隔离等情况。作者的弟弟也感染了新冠病毒，症状严重。最后，作者在2023年1月2日转阴，但仍然有咳嗽的症状。</p>\n","1919810":"<p>这篇文章是关于洛谷上的一道题目P1540 [NOIP2010 提高组] 机器翻译的题解。它首先简单介绍了队列的概念和实现方法，然后解释了这道题目的解题思路，最后给出了代码。整个解题过程就是模拟内存中单词的查找和调入过程，如果内存中没有这个单词，就从外存调入，如果内存容量不够，就先出队再入队。最后统计查询次数即可。</p>\n","28159584":"<p>这篇文章讲述了Phigros游戏自2021年底更新第七章后，直到2022-2023年间未更新主线章节。在今年2月，官方发布了一段预告视频，并在3月底发了新版视频，出现了表魔王。文章还提到了BK对鸽游的采访中透露了Phigros第八章的曲目，包括隐藏曲。文章还详细介绍了3.0版本更新的内容，包括新图标、全新的收藏界面、第八章的解锁流程等。最后，作者猜测第九章可能会有线索。</p>\n","69707535":"<p>这篇文章介绍了如何在Hexo Butterfly博客中添加留言弹幕功能。作者首先提到了一些前置教程和参考资料，然后介绍了他对原有留言弹幕的修改，包括适配亮/暗两个模式、进入评论区自动隐藏弹幕、添加关闭键、添加鼠标悬停暂停功能等。接下来，作者详细介绍了如何在PUG和CSS中进行修改以实现这些功能，并给出了相关代码。最后，作者提到了一些未来计划的功能。</p>\n","70734559":"<p>这篇文章介绍了如何使用CSS来修改bbtalk的默认样式，从时间轴样式改为瀑布流样式。作者提供了一些CSS代码，可以直接应用到bbtalk中。同时，作者也提到了一个小问题，即\"再翻翻\"按钮的位置有点奇怪，可以通过修改bbtalk的配置或者使用CSS来解决。</p>\n","88504706":"<p>这篇文章主要介绍了几种算法，包括 CRT（中国剩余定理）、差分、二分查找、归并排序、快速排序、快速幂、前缀和、最长不下降子序列（LIS）和最长公共子序列（LCS）。文章中给出了每种算法的时间复杂度和代码实现。</p>\n","55af90aa":"<p>这篇文章介绍了一个名为NoTopDomain的软件。该软件是由一名学生开发的，旨在解决信息老师禁用U盘网站等问题。该软件使用PyQt5开发，并使用nuitka打包。它的主要功能与极域有关，包括杀掉/启动极域，挂起/恢复极域，解除黑屏等键盘限制，解除广播全屏化等。该软件可能会报毒，需要手动给杀毒软件加白名单。该软件目前仍处于beta阶段，欢迎使用并提供反馈。可以在Github或蓝奏云上下载。</p>\n","crt5kksk":"<p>这篇文章是一篇游记，作者描述了他在重庆乘坐CRT（重庆轨道交通）的经历。作者原本计划尽量乘坐CRT的所有线路，但由于时间限制和某些线路的独立性，他没有去坐空港线和江跳线。作者在文章中详细描述了他乘坐的线路和车站，以及他在旅途中遇到的有趣的事情。最后，作者总结说CRT做得很好，唯一的遗憾是没能乘坐5号线。</p>\n","ada4230e":"<p>这篇文章讲述了一道题目，题目描述了一个导弹拦截系统，该系统有一个缺陷：虽然它的第一发炮弹能够到达任意的高度，但是以后每一发炮弹都不能高于前一发的高度。输入导弹依次飞来的高度，计算要拦截所有导弹最小需要配备多少套这种导弹拦截系统。文章中提到了贪心策略，即第一次尽量拦截最高的，然后之后的每一次都拦截尽可能高，但是不足上一个的。但是贪心不一定能求出最优解。文章最后给出了代码实现。</p>\n","8f578896":"<p>这篇文章介绍了如何在腾讯云的云开发中使用 Twikoo 评论系统。作者发现腾讯云的云开发可以免费使用六个月，而且 Twikoo 的 Vercel API 很慢，所以决定更换。但是两者的 API 不同，需要修改原有的 JS 代码。作者给出了详细的教程，并提供了修改后的 JS 代码。</p>\n","c1b2fa94":"<p>这篇文章是一篇关于作者在2022年的生活经历和感受的博客文章。作者谈到了疫情对他生活的影响，以及他在学校和家里的生活。他也提到了他在2022年所做的一些事情，包括创建博客、参加比赛、学习新技能等。此外，作者还谈到了他对未来一年的期望，包括提高成绩、学习日语、旅行等。</p>\n","fcfde12":"<p>这篇文章是关于像素塔的一些设定和人物的讨论。文章中提到了一些人物，如鸠、基诺、林泊和非林泊等。文章中还提到了一些关于像素塔的信息，如异想、亚空间和幽蓝边界等。文章中还提到了一些关于人物思想和控制的讨论。</p>\n","976a035b":"<p>这篇文章描述了作者尝试安装 HydroOJ 的过程。由于 HydroOJ 的作者对宝塔有抵触，安装程序会在检测到宝塔时自动退出。因此，作者下载了安装脚本中的 setup.sh 文件，并找到了其中的一段 base64 代码。作者将其转换为 min.js 并格式化后，发现了自动退出的部分。作者通过注释掉这部分代码并重新编码，成功解决了问题。</p>\n","e536ec4":"<p>这篇文章主要讲述了Windows Longhorn的开发历程。Longhorn是微软在Windows XP发布后开始开发的一个新系统，代号为Longhorn，后来正式名字为Vista。文章详细介绍了Longhorn的开发历程，包括Pre-reset（Milestone 2~7）（重置前）和Reseted（(Pre)Beta1~2&amp;&amp;Release）（重置后）两个部分。文章还提到了Longhorn被重置的原因，以及Longhorn的三大基石：Avalon、WinFS、Indigo。最后，文章还介绍了如何在虚拟机中安装Longhorn Build 4074，并解锁其完全体。</p>\n","670e47f":"<p>这篇文章主要介绍了如何在Hexo Butterfly博客中进行魔改，包括对CommentBarrage V3.0的更新，基于腾讯云Cloudbase云开发的Twikoo评论弹幕扩展，以及如何使用Swiper进行首页轮播。此外，还提到了如何扩展更多表情包。</p>\n","e433f3d":"<p>这篇文章主要讲述了如何使用 Cloudflare Pages、Vercel 和 Netlify 来托管博客。作者首先对比了这三个托管商的 Ping 信息，然后详细介绍了如何在这三个托管商上注册、创建 Pages、绑定自己的域名等操作。最后，作者还提到了一些可能遇到的问题以及解决方案。</p>\n","":"<p>您好，这是必应。您可以提供文章的链接或者内容吗？我将尽力为您概括文章内容。</p>\n","becc831a":"<p>这篇文章主要介绍了作者对Hexo Butterfly博客的魔改，包括评论弹幕V2.0的更新，修复了QQ头像的bug，弹幕自带跳转评论功能，优化了动画，并计划在3.0版本中加入swiper功能。此外，作者还提到了2.0弹幕不再支持Waline/Valine评论，但支持了pjax，并给出了相关配置方法。文章最后还提供了一些代码示例。</p>\n","8b73c6b7":"<p>这篇文章是关于 P1055 [NOIP2008 普及组] ISBN 号码的题解。它解释了如何使用 scanf 函数直接输入数字，以及如何处理最后一位识别码可能出现的 X。文章中还提到了如何拆分位数，以及如何将每一位加起来并进行 mod 11 运算。最后，文章给出了一份参考代码。</p>\n","ac792cf4":"<p>这篇文章主要介绍了如何魔改Hexo Butterfly博客。作者分享了如何实现彩色友链、鼠标指针、彩虹猫加载页等效果。文章中详细介绍了修改外挂标签js、修改css、重写loading-js.pug和loading.pug等步骤。</p>\n","/links":"<p>这篇文章列出了94个友链，包括开发基础、推荐网站和推荐友链。它还提供了一些网站框架，如Hexo、Butterfly和Node.js。文章还提供了一些作者推荐的友链，包括Akilar、张洪Heo、贰猹的小窝等。文章最后提供了如何申请友链的方法。</p>\n","/speaks":"<p>这段代码定义了一个名为 <code>doSpeaks</code> 的函数，该函数将文档标题设置为 <code>'说说 | Ariasakaの小窝'</code> 并初始化了 <code>bbtalk</code> 对象。此外，还添加了两个事件监听器，分别在文档加载完成和 <code>pjax:complete</code> 事件发生时调用 <code>doSpeaks</code> 函数。</p>\n","92c7795e":"<p>这篇文章是关于一道题目的解析。题目名为“P3956 [NOIP2017 普及组] 棋盘”，来自洛谷。题目描述了一个棋盘，棋盘上的每个格子可能是红色、黄色或没有颜色。你需要从棋盘的左上角走到右下角，每次移动到不同颜色的格子需要花费1个金币，可以花费2个金币施展魔法让下一个无色格子暂时变为指定颜色。题目要求求出花费的最少金币数。</p>\n<p>文章中给出了一种解决方案，使用深度优先搜索（DFS）算法，并使用剪枝优化搜索过程。剪枝的方法包括：如果当前金币已经比最小值多，则不再搜索；在循环中判断搜索合法性，减小函数调用开销；使用记忆化记录到达当前坐标合法路径的最小金币数，如果超过则不再搜索。</p>\n<p>文章最后给出了完整的代码实现。请注意，这篇文章包含大量的LaTeX公式和代码，可能不太容易阅读。</p>\n","byewnt63":"<p>这篇文章是关于Windows 8.1操作系统的支持将于2023年1月10日结束。作者提到，尽管Windows 8.1并不是一个受欢迎的系统，但它的流畅度却优于其他现代Windows系统。作者还提到了Windows 8.1的前身Windows 8，以及它的失败拯救尝试——Windows 8.1。</p>\n","30bce1d1":"<p>这篇文章讲述了如何适配pjax。作者提到了DOM层面的适配，包括加上类名.js-pjax和扩展元素到全站范围。在JS适配方面，作者提到了加上data-pjax类，处理事件绑定问题和解决鬼畜问题。作者还提到了对于一些没法适配pjax的第三方脚本，可以加入exclude里面。</p>\n","a844d9fc":"<p>这篇文章是一篇悼文，它宣布了江泽民同志于2022年11月30日12时13分在上海逝世的消息。文章回顾了江泽民同志的生平事迹，赞扬了他作为一位卓越领导人、伟大的马克思主义者、无产阶级革命家、政治家、军事家、外交家和共产主义战士所作出的巨大贡献。文章号召全党全军全国各族人民化悲痛为力量，继承江泽民同志的遗志，以实际行动表达我们的悼念。</p>\n","ec12b762":"<p>这篇文章介绍了如何使用 cloudflared 隧道来实现内网穿透。作者提供了详细的步骤，包括如何下载和安装 cloudflared 软件，如何配置和运行隧道，以及如何使用 Apache 和宝塔来配置网站。作者还提到了一些注意事项，例如本教程不适用于 WordPress，可能有封号风险，并且建议购买付费 VPS。此外，作者还提到了一些其他的反代方法，包括使用 CFWorker 和隐性转发。</p>\n","5e2c4b67":"<p>这篇文章讲述了作者在写uClock程序时，如何实现窗口右键直接控制窗口是否置顶的功能。作者通过不断试错，最终找到了解决方案。他发现可以通过设置WindowFlag的方式来控制显示后的窗口是否置顶，但是并不能在运行时实时控制。于是他尝试在程序运行时直接调用这个方法，结果窗口消失了。然后他又加了一句self.show()，窗口重新显示了。但是此时的窗口状态很奇怪，有托盘，还有最小化关闭窗口图标。作者发现是因为并没有继承之前的SplashScreen属性，所以直接继承上以前的窗口状态就好了。取消置顶同理，从以前的windowFlags里面排除掉置顶部分，重新show就可以了。最后作者实现了智能切换功能，并且uClock开源，采用MIT协议。</p>\n","a90c94cd":"<p>这篇文章讲述了2022年12月7日中国政府发布了一份关于进一步优化落实新冠肺炎疫情防控措施的通知，其中明确指出了“新十条”以及其落实。这意味着政府放下了三年来守护的手，剩下的将由群众们自己扛。文章还回顾了疫情这三年，大家对疫情的态度已经从众志成城抗击疫情，主动配合防疫工作，变成了“封麻了，什么时候才解封啊”；“又要做核酸，烦不烦嘛”这种态度。最后，作者希望新冠快快退散。</p>\n","4bd8701b":"<p>这篇文章提到了最近知名的GitHub被墙，全局DNS&amp;SNI阻断，github.io被列入工信部黑名单。作者建议使用Steam++进行代理，完美裸连。作者也提醒大家不要出口狂言，以免得牢狱之灾。作者认为国内没有好的平台。</p>\n","a61abc":"<p>这篇文章描述了作者在重庆的疫情经历。自国庆节后，重庆的疫情反复，10月16日出现零星病例，随后学校封校一个周末。但是十月末疫情突然反扑，新增了几十例。作者被父母接回家，但是发现家门口超市已经成为高风险区域。全市开始静默管理，作者父亲被关在公司。作者认为政府防疫不力，公共场所不强制戴口罩，渝康码也不准确。作者认为重庆可能会成为第三轮疫情的中心。最后，作者吐槽了重庆轨道交通集团，在疫情严重的情况下仍然运行。</p>\n","https://netlify.yaria.top/speaks":"<p>这段代码定义了一个名为 <code>doSpeaks</code> 的函数，它将文档标题设置为 <code>'说说 | Ariasakaの小窝'</code> 并使用 <code>bbtalk.init</code> 初始化了一个应用。该应用的 <code>appId</code> 为 <code>\"IvW3T1NjMoh7OmKEdAz1tM0o-gzGzoHsz\"</code>，<code>appKey</code> 为 <code>\"vG8s9ukVO5bgozEHzR923dew\"</code>，<code>serverURLs</code> 为 <code>'https://ivw3t1nj.lc-cn-n1-shared.com'</code>，并且 <code>pageSize</code> 为 <code>1919810</code>。此外，当文档加载完成时，会调用 <code>doSpeaks</code> 函数。当触发 <code>'pjax:complete'</code> 事件时，也会调用 <code>doSpeaks</code> 函数。</p>\n","https://netlify.yaria.top583ff077":"<p>这篇文章介绍了如何在博客中引入CSS和JS文件，以及如何使用jQuery。它还解释了DIFF代码块的含义，并给出了一个例子来说明如何根据DIFF代码块修改文件。文章中提到，要注意文件的存放位置，以及在主题配置文件中正确地引入文件。此外，如果使用pjax，建议加上data-pjax。</p>\n","https://netlify.yaria.topbd7ef112":"<p>这篇文章介绍了如何在Hexo Butterfly博客中添加一个悬停随机导航的banner。作者提供了详细的步骤和代码，包括如何创建banner容器，引入banner的pug，添加css和js文件，以及如何在不同尺寸的屏幕上显示或隐藏banner。最后，作者展示了一个成功添加banner的效果。</p>\n","https://netlify.yaria.topac792cf4":"<p>这篇文章主要介绍了如何魔改Hexo Butterfly博客。作者分享了如何实现彩色友链、鼠标指针、彩虹猫加载页等效果。文章中提供了详细的代码和步骤，以及一些参考链接。</p>\n","https://netlify.yaria.topbecc831a":"<p>这篇文章主要介绍了作者对Hexo Butterfly博客的魔改过程。作者更新了评论弹幕的样式和功能，修复了QQ头像的bug，并计划在3.0版本中加入swiper功能。此外，作者还提供了一些有关于腾讯云Cloudbase云开发的Twikoo评论弹幕扩展的信息。文章中还包含了一些有关于浏览器版本检测和cookie设置的代码。</p>\n","https://netlify.yaria.top670e47f":"<p>这篇文章主要介绍了如何在Hexo Butterfly博客中进行魔改，包括CommentBarrage V3.0的更新，基于腾讯云Cloudbase云开发的Twikoo评论弹幕扩展，以及如何使用Swiper进行首页轮播。此外，文章还提到了如何扩展更多表情包。</p>\n","https://netlify.yaria.top30bce1d1":"<p>这篇文章讲述了如何适配pjax。作者提到了DOM层面的适配，包括加上类名.js-pjax和扩展元素到全站范围。在JS适配方面，作者提到了加上data-pjax类，处理事件绑定问题和解决鬼畜问题。作者还提到了对于一些没法适配pjax的第三方脚本，可以加入exclude里面。</p>\n","https://netlify.yaria.topc1b2fa94":"<p>这篇文章是一篇个人博客，作者回顾了2022年的生活经历和感受。作者提到了疫情对生活的影响，以及自己在学习、娱乐和个人成长方面的经历。作者还提到了自己创建博客的过程，并分享了一些个人目标和计划。</p>\n","https://netlify.yaria.top69707535":"<p>这篇文章讲述了如何对Hexo Butterfly博客的留言弹幕进行魔改。作者最初是从Dorakika那里抄来的留言弹幕，但发现它有一些问题，比如没有对昼夜两个模式作适配，颜色比较花哨，没有自动隐藏等。因此，作者对这个弹幕进行了一些修改，包括适配亮/暗两个模式，在只显示一个弹幕的时候有更好的体验，进入评论区自动隐藏弹幕等。文章中还提供了详细的教程，包括PUG部分和CSS部分的修改。</p>\n","14740f7c":"<p>这篇文章讲述了作者在寻找一个免费的VPS作为Minecraft服务器和Wordpress站点的过程。作者最初使用了三丰云，但由于配置太差且续期麻烦而放弃。之后尝试了Okteco的VPS白嫖，但官方条款严格且SSH连接不稳定。最后，作者发现了Goorm，一个韩国在线IDE平台，它提供免费版且速度不错。作者在文章中介绍了如何注册Goorm并添加服务器，以及如何使用终端和安装宝塔面板。作者还提醒读者注意Goorm的服务条款限制，以免被封号。</p>\n","861389da":"<p>这篇文章是关于Rizline音游的评测。Rizline是一款商业音游，它在港澳台地区发布已经有一个多月了。它有一些独创的打法，比如Rizcard和联机对战。但是，由于商业音游国区需要拿版号，所以目前只能在港澳台地区体验。</p>\n<p>文章中提到，Rizline的界面简洁，玩法新颖，采用了全屏判定。它还有多人联机对战功能，这是Phi所没有的。不过，文章也指出了Rizline的一些缺点，比如性能问题糟糕，UI有点单调，需要氪金。</p>\n<p>总的来说，作者认为Rizline现在的状态就像一个半成品。虽然它有一些优点，但也存在一些问题。</p>\n","895003b5":"<p>这篇文章是关于如何修改Hexo Butterfly博客的导航栏。作者提供了一些基础教程，包括分离搜索栏与菜单栏，使导航栏居中，去掉导航栏项目底下的蓝色长条，添加回到顶部按钮等。作者还提供了详细的代码和步骤说明。</p>\n","f34c4b49":"<p>这篇文章主要介绍了如何使用Hexo Butterfly博客主题进行魔改。文章首先介绍了一些前置教程和主题仓库，然后详细讲解了如何进行初步准备工作，包括克隆Acryple主题和安装依赖。接下来，文章详细介绍了如何进行基础修改，包括修改BBTalk、关于页面、APlayer播放列表、页脚运行时间、Github日历、sw、评论弹幕、个人信息和朋友圈等。最后，文章还提供了一些需要注意的点和可有可无的其它修改指南。</p>\n","583ff077":"<p>这篇文章介绍了如何在博客中引入CSS和JS文件，以及如何使用jQuery库。它还解释了DIFF代码块的含义，即“-”号表示删除源文件的内容，\"+\"号表示在这里增加。文章中还提供了一些示例来说明如何修改文件。</p>\n","8820b6d1":"<p>这篇文章介绍了一道题目：P4008 [NOI2003] 文本编辑器。文章中给出了题目描述、输入输出格式、样例和解题思路。解题思路中提到了使用rope来解决这道题，文章中给出了rope的用法和代码实现。最后，作者提醒读者注意读入方式，建议关闭流同步或使用快读来卡常。</p>\n","blog1yr":"<p>您好，这是必应。您能提供一下您想要我概括的文章的链接吗？😊</p>\n","4ebac27c":"<p>这篇文章主要是关于编程的，包括了一些编程技巧和算法。它提到了排序、斐波那契数列、质数、快读快写、最大公约数、搜索、二分、DFS、BFS和DP等内容。文章中还包含了一些代码示例。最后，作者提到了数据结构中的链表，但并未详细展开。</p>\n","aedd05c3":"<p>这篇文章介绍了如何使用eu.org域名注册服务来免费注册域名。作者首先介绍了eu.org的背景和历史，然后详细介绍了如何在eu.org官网上注册和申请域名。文章还提到了如何解决一些常见的问题，例如如何申请DNS服务器。最后，作者提醒读者，申请域名需要经过审核，可能需要等待一段时间。</p>\n","5d71c71f":"<p>这篇文章介绍了如何使用VSCode编辑器代替DevC++编辑器进行C++开发。文章首先介绍了DevC++的优点和缺点，然后详细介绍了如何安装和配置VSCode，包括安装Mingw8.1，配置环境变量，安装C/C++扩展和Code runner插件，并提供了一些美化和骚操作的方法。最后，文章还提供了一些有关VSCode的背景信息。</p>\n","/bangumis":"<p>对不起，我无法理解您的问题。您能否重新描述您的问题，以便我更好地为您提供帮助？</p>\n","/movies":"<p>您好！很抱歉，您没有提供文章的链接或内容，所以我无法概括文章的内容。您能提供文章的链接或内容吗？</p>\n","/fcircle":"<p>对不起，我无法概括这篇文章的内容，因为您提供的信息不足以确定文章的内容。您能提供更多信息吗？</p>\n","/othersite":"<p>这篇文章介绍了一些博主搭建的站点，包括域名、用途和搭建原因。例如，yaria.top是博主的博客和主站，用于分享一些东西；tanzhen.yaria.top是搭建的小鸡哪吒探针；oj.yaria.top是OnlineJudge系统，用于自己练习OI；status.yaria.top是网站状态监控，基于uptimeRobot；mcs.yaria.top是Minecraft服务器，用来联机玩玩的服务器；yisous.tk是短链接生成器，使用本站域名；bbs.yaria.top是AriaBBS，自己用NodeBB弄得一个小论坛。文章还介绍了博主的一些域名及其用途。最后，文章提醒读者本博客强制HTTPS，旧电脑可能会出现问题。</p>\n","3ee11b0f":"<p>这篇文章讲述了作者在使用Goorm平台时，因为下载软件被封号的经历。作者描述了他在Goorm平台上运行多个服务器，其中一个服务器在下载软件时被封号。作者随后查询了Goorm的帮助文档，发现Goorm会封锁运行某些程序的账号，包括代理服务器和文件上传下载服务器等。作者认为他被封号的原因可能是因为使用了Cloudflare Tunnel或者下载上传文件过多。最后，作者建议大家尽快备份文件和数据库，并尽早更换其他平台。</p>\n","11eb4aac":"<p>这篇文章讲述了如何在Hexo Butterfly博客中魔改右键菜单。作者参考了Dorakika的原版右键菜单，并在此基础上进行了一些改进，增加了诸如粘贴、空降评论、繁简转换、版权声明、复制文章地址、图片功能、a标签打开功能、百度搜索文本和转到链接功能等。作者还提供了详细的魔改教程，包括PUG和JS部分的修改。</p>\n","bd7ef112":"<p>这篇文章介绍了如何在Hexo Butterfly博客中添加一个banner。作者提供了详细的步骤和代码，包括如何创建一个banner容器，如何引入banner的pug，如何添加css和js文件，以及如何调整banner的显示效果。作者还提醒读者不要直接使用他人的cdn，而应该自己添加css和js文件。</p>\n","6d1af91":"<p>这篇文章是关于作者搭建博客的经历和想法。作者花了一个多月的时间魔改和开发，最终上线了一个简陋的博客。由于作者是学生，所以博客的所有东西都是免费的，托管在海外，域名也是免费的。作者提到了中国的网络安全法和备案问题。作者搭建博客的目的是为了分享经验和知识，并希望能够坚持写下去。目前，博客还处于试运行阶段，文章偏向于测试。</p>\n","614f1131":"<p>这篇文章讲述了作者在使用Hexo Butterfly博客时，遇到了aplayer播放器每次刷新页面都会停止播放的问题。作者尝试使用pjax解决问题，但是遇到了更多的bug。于是作者采取了一种折中方案，使用js记录播放进度并且在每次刷新后都重新定位。作者参考了l3yx’s blog上的一篇文章，并对其中的js代码进行了修改，使其能够配合官方文档的Meetingjs食用。最后，作者给出了修改后的js代码。</p>\n","45897d5c":"<p>这篇文章是关于作者对何同学的看法。作者在2020年下半年开始使用B站，因为3D打印机教程而接触到何同学。作者认为何同学的早期视频很优秀，但是对2022年的新视频感到失望。作者认为新视频的质量不如以前，没有给他带来震撼感。作者认为何同学现在只有剪辑和后期能力，被资本吸引而没有创意。作者希望何同学能回归数码评测。</p>\n","6deceee9":"<p>这篇文章讲述了作者在尝试将新电脑从 Windows 11 22H1 升级到 22H2 时遇到的问题以及解决方法。作者在升级过程中遇到了错误代码 0x8007001f，尝试了网上搜索到的各种解决方法，包括运行 sfc /scannow、DISM 命令、使用工具（易升、安装助手）、干净启动等，但都没有用。最后，作者在事件查看器中发现了另一个错误代码，经过搜索发现可能是由于 Windows 更新缓存问题、Windows Search 服务问题、部分服务问题或 WinRE 损坏造成的。作者发现自己的 WinRE 是损坏的，于是按照一篇文章的指引进行了修复。但是，这样并没有解决问题，更新仍然失败。最后，在 Microsoft Community 上有人给了作者一段修复代码，作者复制到 PowerShell 里面运行后重启电脑，更新成功。</p>\n","/kongtiao":"<p>您好，这是必应。您能提供一下文章的链接或者标题吗？这样我才能帮您概括文章内容。😊</p>\n","https://github.yaria.top14740f7c":"<p>这篇文章主要讲述了作者在寻找一个VPS作为Minecraft服务器和Wordpress站时的经历。作者最初使用了三丰云，但由于配置太差且续期麻烦而放弃。后来尝试了Okteco的VPS白嫖，但官方条款严格，SSH连接不稳定，甚至Screen、nohup都不管用。作者发现能嫖的不多，只有EUServ，但安装费需要2欧元。最后作者发现很多在线IDE都是用Docker的虚拟机内嵌IDE实现的，于是研究了一下Goorm和Coding Web Studio，最终选择了Goorm。Goorm是一个韩国在线IDE平台，免费版的东西也不错，速度不错，休眠不会删数据且恢复速度很快。作者还介绍了如何在Goorm上注册、添加服务器、始终开启设置、使用终端、安装宝塔面板、修改宝塔的默认账号密码以及Goorm的服务条款限制。</p>\n","4ae2ec41":"<p>这篇文章是关于如何在Hexo Butterfly博客中添加日历插件和天气插件的教程。它提供了详细的步骤，包括修改PUG文件，添加JS和CSS代码，以及修改主题配置文件。文章中还提到了日历插件的一些问题，例如它不支持pjax，可能会导致性能问题。</p>\n","/license":"<p>这篇文章是关于LYX 2022的版权声明。文章提到了本站所有原创文章采用CC协议中比较严格的创作共用-非商业性-禁止演绎4.0国际标准。本站无广告嵌入和商业行为，违反协议的行为会损害原作者的创作热情，影响整个版权环境。文章还介绍了博客的分类，包括经验分享和转载内容。最后，文章提到了您可以做什么，需要遵守什么样的许可，什么内容会被版权保护，以及例外情况。</p>\n","7e9276a3":"<p>这篇文章介绍了如何在Hexo Butterfly博客中添加一个弹窗功能，用来在特定的纪念日或节日显示弹窗庆祝。这个脚本使用会话存储记录，保证不会多次弹窗影响浏览体验，支持传统节日和公历节日的计算。它基于SweetAlert库实现弹窗，并提供了详细的教程和代码示例。</p>\n","a1078b2d":"<p>这篇文章讲述了作者在深思熟虑后决定为博客独立一个新主题，这个主题不再是butterfly，而是Acryple。这个名字源自于Simple主题和Acrylic主题的结合。作者还提到了更新日志和效果图，并且在GitHub上开源了这个主题。最后，作者恭喜自己成功水文并告辞。</p>\n","/update":"<p>这篇文章是关于 Acryple 博客主题的更新日志。它记录了从 2022 年 10 月 23 日到 2023 年 5 月 28 日的更新内容，包括修复 bug、优化性能、增加新功能和改进 UI 等。作者还提到了一些未来计划的功能。</p>\n","1b850b16":"<p>这篇文章介绍了如何在Hexo Butterfly博客中添加点赞功能。作者提到了B站视频的点赞功能，然后介绍了如何在博客中添加类似的功能。文章中包含了详细的教程，包括修改pug文件和添加JavaScript代码。作者还提到了未来可能会增加收藏功能和账号登录功能。</p>\n","65ad2601":"<p>这篇文章是关于一道题目的解题报告。题目名为“[CSP-J 2021] 网络连接”，来自洛谷。题目描述了一个简化的网络连接场景，其中计算机分为服务机和客户机两类。服务机负责建立连接，客户机负责加入连接。每台计算机在尝试建立或加入连接时需要提供一个地址串。文章详细描述了地址串的规范和不符合规范的情况。文章还描述了服务机和客户机的连接情况，并给出了输入和输出格式。最后，文章给出了一种使用正则表达式和Python语言的解题方法。</p>\n","/muyu":"<p>这篇文章包含了一些HTML，CSS和JavaScript代码，它们定义了一个名为“muyu-layout”的布局，其中包含了一个名为“muyu-box”的图片和一个名为“jishu-box”的文本框。这些代码还定义了一些动画效果和音频播放功能。当用户点击“muyu”时，会触发一个动画效果并播放音频，同时“jishu-box”中的文本会更新，显示累计的“功德”值。</p>\n","d1fc759":"<p>这篇文章是关于如何在Hexo Butterfly博客中进行宽屏适配的教程。作者提到了随着显示器成本降低，越来越多的人使用大屏幕，因此博客的标准宽度显得很憋屈。文章详细介绍了如何通过修改CSS来调整博客的宽度、边栏卡片大小、分页适配和友链界面适配，以提高空间利用率并使博客看起来更舒服。</p>\n","bbc95d58":"<p>这篇文章主要介绍了如何在宝塔面板上安装LAMP环境，以及如何解决安装过程中可能遇到的问题。文章还提供了一些清除残留文件的教程，以及如何测试服务器是否正常运行。最后，文章介绍了如何在宝塔面板上部署Hexo和WordPress。</p>\n","ff1701d7":"<p>这篇文章讲述了作者最近购买了一个域名，计划用于主页。硅云推出了五周年庆典活动，除了几种特定的域名外，新用户可以免费注册。作者建议早点注册，因为活动可能不久就关闭了。注册需要实名认证和审核，但不需要刷脸验证。如果想要多搞几个域名，需要多搞几个邮箱和电话和其他人的身份证。作者在文末提供了活动地址。</p>\n","29b0359b":"<p>这篇文章讲述了如何通过申请 Microsoft 365 E5 开发者订阅来获得 Office 365 和 5T 的 OneDrive 空间。文章中提到了如何申请沙盒，自定义域名，修改邮箱，修改 OneDrive 大小以及如何续期。作者建议使用 Vercel 部署方式进行续期。</p>\n","/zaobao":"<p>您好，这是必应。您能提供文章的链接或者内容吗？这样我才能帮您概括文章内容。😊</p>\n","c8da5f65":"这篇文章是一篇关于【ABC098D】 XOR Sum 2 这道题目的题解，这是一道来自 AtCoder 的 OI 类型的题目，要求求出一个序列中满足异或和等于普通和的子区间的个数。作者介绍了题目的大意，解析了题目的思路，给出了一种用双指针和位运算的解法，并附上了代码。文章的语言是中文，代码是 C++。作者还用了一些数学符号和 Markdown 语法来格式化文章，使其更加清晰易懂。\n","9581764a":"这是一篇关于一个叫做区间最大公约数的编程问题的博客文章，它涉及对一个数列进行操作和查询。作者解释了问题的描述，解决方案的主要思路，并提供了两个版本的C++代码。解决方案使用了数据结构如线段树和树状数组来维护数列的差分数组和最大公约数。作者还利用了最大公约数的一些数学性质和一些技巧来优化代码。","mhaoxonk":"本文介绍了使用Hook技术对Windows进行消息处理拦截的原理和方法。首先介绍了钩子的基本概念和分类，然后以Windows Hook实例为例，介绍了如何使用MinHook库进行函数Hook。接着介绍了DLL注入技术，并给出了一个示例代码来演示如何编写一个DLL并进行注入。最后，对整篇文章的内容进行了概括总结。","aa2fa75f":"这篇文章介绍了洛谷题目[SCOI2012] 滑雪的题解。题目要求在给定的滑雪轨道和景点高度下，找出从起点开始，能够滑行到尽可能多的景点，并且滑行路径总距离最短的方案。题解使用了最小生成树算法（Kruskal算法），并结合BFS进行求解。具体的实现过程和注意事项在代码中有详细的注释说明。","c1d78b77":"题目要求通过将集合A中的元素乘以2或除以2的操作，得到集合B。题解使用了贪心策略，维护两个优先队列a和b，每次取出两个队列中的最大值进行操作，直到a为空。具体的操作规则如下：如果a的最大值等于b的最大值，则将这两个元素出队。如果a的最大值大于b的最大值，则将a的最大值除以2后重新入队，并记录操作次数。如果b的最大值大于a的最大值，如果b的最大值是奇数，则无法将a变为b，输出-1；否则，将b的最大值除以2后重新入队，并记录操作次数。最后输出操作次数作为答案。","houwang":"本文介绍了使用pb_ds库中的priority_queue数据结构来解决一个关于猴子争斗的问题。通过维护一个数组存储每个猴子所在集合的朋友，并使用并查集映射每个猴子所在的集合，可以实现猴子争斗后取出堆顶进行操作，并将两个堆合并的功能。这种解法相比于左偏树等其他数据结构更简单。提供了带注释和简化的代码实现。","lgtp3258":"这篇文章介绍了解决「JLOI2014」松鼠的新家问题的算法。首先，需要维护一棵树，每个房间需要一定数量的糖果。然后，维尼从一个房间到另一个房间时，需要在路径上的每个房间都摆上一个糖果。使用树上差分来维护路径上每个节点的差分值，最后还原差分数组，得到每个房间的糖果数量。需要注意输入格式和避免重复计算的问题。提供了带注释和无注释的代码实现。","tadbanlg":"这篇文章介绍了解决「NOIP2013」货车运输问题的算法。题目要求找到一条路径使得路径上的最小权值最大，并输出该最小权值。解决这个问题的思路是先使用Kruskal算法构建最大生成树，然后使用倍增的方式求解LCA（最近公共祖先）。在预处理LCA时，同时维护一个数组wi[u][k]表示点u向上走2^k步时的最小权值。在LCA函数中，判断两个点是否连通，如果不连通则返回-1。最后输出最小权值即可。提供了带注释和无注释的代码实现。","orzzkwdl":"本文介绍了非递归线段树的一种实现方式——ZKW线段树。ZKW线段树是由清华大学的张昆玮发明的，采用了二进制位运算的方式计算节点，具有较优秀的时间复杂度和常数。文章详细介绍了ZKW线段树的建树、单点修改和区间查询操作，并给出了相应的代码示例。同时，还介绍了ZKW线段树在区间修改区间查询问题上的应用，并给出了相应的代码示例。最后，文章贴出了一份树状数组1（线段树1）的ZKW版完整代码，并与普通线段树进行了复杂度对比。","guysb616":"这是一个对最近发布的音乐游戏RYCEAM进行的个人体验评测。作者使用华为Mate30手机进行游玩，并展示了游戏的启动界面、UI界面、设置界面、菜单和选曲界面等。文章介绍了RYC的歌曲难度与解锁系统、MR值计算、键型和判定规则等游戏机制。作者还分享了自己的游玩体验，并展示了打过的一些曲目的成绩。文章列举了RYCEAM的优点和缺点，并提出了一些改进的建议。总的来说，作者认为RYCEAM是一款有潜力的音乐游戏，但还需要进一步优化和改进。","bb62b405":"本文是对题目[SCOI2012] 滑雪的题解进行了讲解。题目要求在一座雪山上，从一个景点出发，通过滑行路径尽可能多地访问其他景点，求滑行总距离最短和访问的景点数最多的方案。题解使用了最小生成树算法和BFS进行遍历。首先建立图的边，根据景点之间的高度关系确定边的添加。然后使用BFS计算从起点出发可以到达的顶点个数。接下来，按照高度和边的权值对边进行排序，并使用Kruskal算法选择滑行路径，直到遍历的边数形成树形结构或者滑行到达的景点个数达到最大值。最后输出滑行到达的景点数和滑行总距离。本文对题目的要求和解题思路进行了简单的解释，并给出了相应的代码实现。","abc176d":"本文是对题目[ABC176D] Wizard in Maze求最少移动次数的题解进行了讲解。题目给出一个包含 '#' 和 '.' 的地图，要求从给定的起点位置 (sx, sy)(sx,sy) 移动到给定的终点位置 (dx, dy)(dx,dy)，每次移动可以选择在 '.' 间移动或者在以当前位置为中心的 5\times55×5 的矩阵内的任意 '.' 移动。要求找到最少移动次数。题解使用了BFS算法，使用双端队列来存储待扩展的状态。首先将起点位置加入队列，然后循环执行以下步骤：从队列中取出一个位置，判断是否为终点位置，如果是则输出移动次数并结束程序。否则，将当前位置标记为已访问，然后按照两种方式进行扩展：在四个方向上移动一格，或者在以当前位置为中心的 5\times55×5 的矩阵内移动。将扩展出的位置加入队列。重复上述步骤直到队列为空。本文给出了注释和无注释两种版本的代码实现，并对代码进行了详细的解释。","1d499ffd":"这道题是一个使用容斥原理的练习题，通过DFS生成所有由2和9组成的数，并筛选出符合条件的数加入集合P。然后使用DFS搜索并剪枝的方式枚举子集并去重，计算答案。时间复杂度为O(2^n*log r)。","e94b15ea":"这篇文章主要是作者关于参加CSP JS 2023比赛的日记和游记。作者在文章中记录了自己报名比赛、准备考试的过程，以及考试当天的情况和题目的解答。作者还分享了自己在考试后的心情和对成绩的预估，以及后续报名参加J组比赛和复役的经历。文章中穿插了一些作者的个人感受和心情，展示了他对比赛和学习的态度。","dbbb90bf":"这篇文章是题解文章，涵盖了CSP-J 2023的部分题目，包括T1 apple、T2 road、T3 uqe。T1 apple是一道简单的模拟题，通过找规律求解；T2 road是一道贪心题，求解加油问题；T3 uqe是一道数学题，求解一元二次方程的根。文章提供了每道题的题目描述、输入输出格式、样例以及题解代码。","2da55a98":"这篇文章是关于作者参加CSP-J 2023复赛的游记。作者在比赛前进行了准备，考了几场模拟赛，得分只有290。比赛当天，作者早早起床去考场，遇到了一些外校生。比赛过程中，作者遇到了一些问题，但最终完成了所有题目。作者在整理代码的过程中发现了一些问题，但并没有得到解决。第二天，作者得到了一些参赛者的代码，并进行了自测。最后，作者提到比赛结束后还要参加半期考试的困扰。","7edb78c4":"这篇文章是关于作者国庆节期间去成都旅游的游记。作者描述了出发前的准备和堵车的经历，以及到达成都后的感受和游览的景点。作者在成都游览了宽窄巷子和太古里，还爬到IFS大楼观看熊猫雕塑。然后，文章中提到了作者在旅行中遇到的一些问题，以及回程时的疲惫和作业的压力。","b7bc969f":"本文是作者对自己在2023年的经历进行总结和展望的文章。作者在文章中回顾了2023年的重要事件和经历，包括新冠疫情、学习、竞赛、旅行等，还提到了自己在B站上的活动和视频制作的计划。同时，作者也表达了对未来的期望和追求，包括学业、兴趣爱好和个人发展。整体来说，这是一篇个人经历总结和展望的文章。","dad8e69b":"这篇文章介绍了在 RK 系开发板的 Linux 内核上编译 CH340 驱动的方法。作者首先解决了系统缺少 Linux 内核头文件的问题，然后手动编译内核，配置了 CH340 驱动，最终通过 systemd 自动加载驱动，使得设备能够正常连接打印机。文章详细介绍了每一步操作，并提供了相关命令和截图，对于需要在 RK 系开发板上进行类似操作的读者具有实用价值。","303b5edc":"文章暂未完成，请等待完成后将提供","dea522be":"这个就没必要给AI摘要了吧..."}